Revit 2027 API
ParameterTypeId.ImportAdtEntityStyle Property
 "Style Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ImportAdtEntityStyle { get; }
Public Shared ReadOnly Property ImportAdtEntityStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ImportAdtEntityStyle {
	ForgeTypeId^ get ();
}
static member ImportAdtEntityStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace